Revit 2027 API
DGNFileFormat Enumeration
 An enumerated type listing available Microstation versions into which a file may be exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DGNFileFormat
Public Enumeration DGNFileFormat
public enum class DGNFileFormat
type DGNFileFormat
Members
Member name | Value | Description
Default | 20 |  The Autodesk Revit application's default file format.
DGNVersion7 | 19 |  Microstation V7 file format.
DGNVersion8 | 20 |  Microstation V8 file format.
See Also
Reference
Autodesk.Revit.DB Namespace